hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/donating/cdm/v1/VaKueMrnAbg_StornoAenderung_07/VA_RRNP_ABG.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <v1:requestCarrierChange xmlns:v1="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
    <v1:VA-RRNP>
      <v1:absender>
        <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
      </v1:absender>
      <v1:empfaenger>
        <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
      </v1:empfaenger>
      <v1:version>2</v1:version>
      <v1:endkundenvertragspartner>
        <v1:EKPauf>
          <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
        </v1:EKPauf>
        <v1:EKPabg>
          <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
        </v1:EKPabg>
      </v1:endkundenvertragspartner>
      <v1:vorabstimmungsId>${preAgreementId}</v1:vorabstimmungsId>
      <v1:kundenwunschtermin>${requestedCustomerDate}</v1:kundenwunschtermin>
      <v1:endkunde>
        <v1:person>
          <v1:anrede>1</v1:anrede>
            <v1:vorname>${endkunde.vorname}</v1:vorname>
            <v1:nachname>${endkunde.nachname}</v1:nachname>
        </v1:person>
      </v1:endkunde>
      <v1:projektId>
        <v1:projektkenner>${wbciSimulatorUseCase}</v1:projektkenner>
      </v1:projektId>
        <v1:rufnummernPortierung>
            <v1:einzelanschluss>
                <v1:rufnummernliste>
                    <v1:zuPortierendeOnkzRnr>
                        <v1:ONKZ>${portierung.onkz.0}</v1:ONKZ>
                        <v1:rufnummer>${portierung.rufnummer.0}</v1:rufnummer>
                    </v1:zuPortierendeOnkzRnr>
                </v1:rufnummernliste>
                <v1:alleRufnummern>true</v1:alleRufnummern>
            </v1:einzelanschluss>
            <v1:portierungszeitfenster>ZF2</v1:portierungszeitfenster>
            <v1:portierungskennungPKIauf>D123</v1:portierungskennungPKIauf>
        </v1:rufnummernPortierung>
    </v1:VA-RRNP>
  </v1:requestCarrierChange>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>